Revit 2027 API
AnalysisDisplayVectorSettings Constructor
 Constructs a default instance of vector settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayVectorSettings()
Public Sub New
public:
AnalysisDisplayVectorSettings()
new : unit -> AnalysisDisplayVectorSettings
See Also
Reference
AnalysisDisplayVectorSettings Class
AnalysisDisplayVectorSettings Overload
Autodesk.Revit.DB.Analysis Namespace